package home3;

public class Program {
    // 1. Напишите программу, чтобы создать новый список массивов, добавить
    // несколько цветов (строку) и вывести коллекцию на экран.
    // 2. Напишите программу для итерации всех элементов списка цветов и добавления
    // к каждому символа '!'.
    // 3. Напишите программу для вставки элемента в список массивов в первой
    // позиции.
    // 4. Напишите программу для извлечения элемента (по указанному индексу) из
    // заданного списка.
    // 5. Напишите программу для обновления определенного элемента массива по
    // заданному элементу.
    // 6. Напишите программу для удаления третьего элемента из списка массивов.
    // 7. Напишите программу для поиска элемента в списке массивов.
    // 8. Напишите программу для сортировки заданного списка массивов.
    // 9. Напишите программу для копирования одного списка массивов в другой.
}
